tomrodinger/ESP32_STM32_programmer/src/main.cpp
  firmware_source::FileReader file_reader(SPIFFS);
  if (!file_reader.open(fw_path.c_str())) {
    Serial.printf("Write FAIL (could not open firmware file: %s)\n", fw_path.c_str());
    return false;
  }

  Serial.printf("Write(prod) using serial=%lu unique_id=0x%08lX%08lX\n", (unsigned long)serial,
                (unsigned long)(unique_id >> 32), (unsigned long)(unique_id & 0xFFFFFFFFu));

  firmware_source::ProductInfoInjectorReader injected(file_reader, serial, unique_id);
  firmware_source::Stm32G0Adapter fw_reader(injected);

  const uint32_t t0 = millis();
  const bool connect_ok = stm32g0_prog::connect_and_halt();
  const uint32_t t1 = millis();

  bool prog_ok = false;
  if (connect_ok) {
    swd_min::set_verbose(false);

    // Ensure first block is materialized so we can snapshot it for subsequent verify.
    uint8_t tmp[1];
    uint32_t out_n = 0;
    (void)injected.read_at(0, tmp, 1, &out_n);
    const uint8_t *b0 = injected.first_block_ptr();
    if (b0) {
      set_first_block_snapshot(b0, firmware_source::ProductInfoInjectorReader::first_block_size());
    }

    prog_ok = stm32g0_prog::flash_program_reader(stm32g0_prog::FLASH_BASE, fw_reader);
    swd_min::set_verbose(prev_verbose);
  }
  const uint32_t t2 = millis();

  const uint32_t ms_connect = t1 - t0;
  const uint32_t ms_program = t2 - t1;
  const uint32_t ms_total = t2 - t0;

  const float prog_s = (ms_program > 0) ? (ms_program / 1000.0f) : 0.0001f;
  const float kbps = (file_reader.size() / 1024.0f) / prog_s;

  Serial.printf("Benchmark w(prod): connect=%lums program=%lums total=%lums (%.2f KiB/s)\n",
                (unsigned long)ms_connect, (unsigned long)ms_program, (unsigned long)ms_total, (double)kbps);

  const bool ok = connect_ok && prog_ok;
  Serial.println(ok ? "Write OK" : "Write FAIL");
  return ok;
}

static bool cmd_verify() {
  String fw_path;
  if (!select_firmware_path(fw_path)) {
    Serial.println("Verify FAIL (no valid firmware file selected)");
    return false;
  }

  firmware_source::FileReader file_reader(SPIFFS);
  if (!file_reader.open(fw_path.c_str())) {
    Serial.printf("Verify FAIL (could not open firmware file: %s)\n", fw_path.c_str());
    return false;
  }

  // Verify policy:
  // - If we have a snapshot of the injected first block, use it for offsets < 256.
  // - Otherwise verify the raw file for all bytes.
  firmware_source::Stm32G0Adapter fw_reader(file_reader);
  firmware_source::FirstBlockOverrideReader override0(file_reader,
                                                      g_first_block_snapshot_valid ? g_first_block_snapshot : nullptr,
                                                      g_first_block_snapshot_valid ? 256u : 0u);
  firmware_source::Stm32G0Adapter fw_reader_override(override0);

  // Production-oriented verify:
  // - Use aggressive connect-under-reset + immediate halt so user firmware cannot
  //   disable SWD pins before we halt the core.
  // - Use fast verify (bulk AHB-AP reads) and avoid dumping all bytes.
  const bool prev_verbose = swd_min::verbose_enabled();
  // For production speed, keep SWD verbose off for the whole verify operation.
  swd_min::set_verbose(false);

  const uint32_t t0 = millis();
  const bool connect_ok = stm32g0_prog::connect_and_halt_under_reset_recovery();
  const uint32_t t1 = millis();

  uint32_t mismatches = 0;
  bool verify_ok = false;
  if (connect_ok) {
    stm32g0_prog::FirmwareReader &r = g_first_block_snapshot_valid
                                         ? static_cast<stm32g0_prog::FirmwareReader &>(fw_reader_override)
                                         : static_cast<stm32g0_prog::FirmwareReader &>(fw_reader);
    verify_ok = stm32g0_prog::flash_verify_fast_reader(stm32g0_prog::FLASH_BASE, r, &mismatches, /*max_report=*/8);
  }
  const uint32_t t2 = millis();

  swd_min::set_verbose(prev_verbose);

  const uint32_t ms_connect = t1 - t0;
  const uint32_t ms_verify = t2 - t1;
  const uint32_t ms_total = t2 - t0;

  // Throughput estimate (payload bytes / verify time). Avoid div by zero.
  const float verify_s = (ms_verify > 0) ? (ms_verify / 1000.0f) : 0.0001f;
  const float kbps = (file_reader.size() / 1024.0f) / verify_s;

  Serial.printf("Benchmark v: connect=%lums verify=%lums total=%lums (%.2f KiB/s over verify phase)\n",
                (unsigned long)ms_connect, (unsigned long)ms_verify, (unsigned long)ms_total, (double)kbps);
  Serial.printf("Verify mismatches: %lu\n", (unsigned long)mismatches);

  const bool ok = connect_ok && verify_ok;
  Serial.println(ok ? "Verify OK (all bytes match)" : "Verify FAIL");
  return ok;
}

static bool cmd_verify_with_product_info(uint32_t serial, uint64_t unique_id) {
  String fw_path;
  if (!select_firmware_path(fw_path)) {
    Serial.println("Verify FAIL (no valid firmware file selected)");
    return false;
  }

  firmware_source::FileReader file_reader(SPIFFS);
  if (!file_reader.open(fw_path.c_str())) {
    Serial.printf("Verify FAIL (could not open firmware file: %s)\n", fw_path.c_str());
    return false;
  }

  Serial.printf("Verify(prod) expecting serial=%lu unique_id=0x%08lX%08lX\n", (unsigned long)serial,
                (unsigned long)(unique_id >> 32), (unsigned long)(unique_id & 0xFFFFFFFFu));

  // Prefer verifying against the first-block snapshot created during the write.
  // If snapshot is missing, fall back to re-injecting for verify.
  firmware_source::FirstBlockOverrideReader override0(file_reader,
                                                      g_first_block_snapshot_valid ? g_first_block_snapshot : nullptr,
                                                      g_first_block_snapshot_valid ? 256u : 0u);

  firmware_source::ProductInfoInjectorReader injected(file_reader, serial, unique_id);

  firmware_source::Stm32G0Adapter fw_reader_snapshot(override0);
  firmware_source::Stm32G0Adapter fw_reader_injected(injected);

  const bool prev_verbose = swd_min::verbose_enabled();
  swd_min::set_verbose(false);

  const uint32_t t0 = millis();
  const bool connect_ok = stm32g0_prog::connect_and_halt_under_reset_recovery();
  const uint32_t t1 = millis();

  uint32_t mismatches = 0;
  bool verify_ok = false;
  if (connect_ok) {
    stm32g0_prog::FirmwareReader &r = g_first_block_snapshot_valid
                                         ? static_cast<stm32g0_prog::FirmwareReader &>(fw_reader_snapshot)
                                         : static_cast<stm32g0_prog::FirmwareReader &>(fw_reader_injected);
    verify_ok = stm32g0_prog::flash_verify_fast_reader(stm32g0_prog::FLASH_BASE, r, &mismatches, /*max_report=*/8);
  }
  const uint32_t t2 = millis();

