tomrodinger/ESP32_STM32_programmer/src/main.cpp
  swd_min::set_verbose(prev_verbose);

  const uint32_t ms_connect = t1 - t0;
  const uint32_t ms_verify = t2 - t1;
  const uint32_t ms_total = t2 - t0;

  const float verify_s = (ms_verify > 0) ? (ms_verify / 1000.0f) : 0.0001f;
  const float kbps = (file_reader.size() / 1024.0f) / verify_s;

  Serial.printf("Benchmark v(prod): connect=%lums verify=%lums total=%lums (%.2f KiB/s)\n",
                (unsigned long)ms_connect, (unsigned long)ms_verify, (unsigned long)ms_total, (double)kbps);
  Serial.printf("Verify mismatches: %lu\n", (unsigned long)mismatches);

  const bool ok = connect_ok && verify_ok;
  Serial.println(ok ? "Verify OK (all bytes match)" : "Verify FAIL");
  return ok;
}

static bool cmd_read_flash_first_8() {
  Serial.println("Reading first 8 bytes of target flash via SWD...");

  // Make this command self-contained: it should work on a fresh/unprogrammed chip
  // without requiring the user to run 'i' first.
  if (!cmd_connect()) {
    Serial.println("Read FAIL (could not connect + halt)");
    return false;
  }

  uint8_t buf[8] = {0};
  uint32_t optr = 0;
  const bool ok = stm32g0_prog::flash_read_bytes(/*addr=*/stm32g0_prog::FLASH_BASE, buf, /*len=*/8, &optr);

  if (!ok) {
    Serial.println("Read FAIL");
    return false;
  }

  Serial.printf("FLASH_OPTR @ 0x40022020 = 0x%08lX (RDP byte=0x%02X)\n", (unsigned long)optr,
                (unsigned)((optr >> 0) & 0xFFu));

  Serial.printf("0x%08lX: ", (unsigned long)stm32g0_prog::FLASH_BASE);
  for (int i = 0; i < 8; i++) {
    Serial.printf("%02X ", buf[i]);
  }
  Serial.println();
  return true;
}

static bool cmd_swd_smoke_test() {
  Serial.println("SWD smoke test...");
  // Assumes SWD already attached via 'i' or the boot-time auto attempt.
  uint8_t ack = 0;

  // 2) DP power-up handshake
  Serial.println("DP init + power-up...");
  const bool dp_ok = swd_min::dp_init_and_power_up();
  Serial.println(dp_ok ? "DP init OK" : "DP init FAIL");
  if (!dp_ok) return false;

  // 3) Release reset then read AHB-AP IDR (tests DP.SELECT + AP read semantics)
  swd_min::set_nrst(false);
  delay(5);

  Serial.println("Reading AHB-AP IDR (AP register 0xFC)...");
  uint32_t ap_idr = 0;
  const bool ap_ok = swd_min::ap_read_reg(swd_min::AP_ADDR_IDR, &ap_idr, &ack);
  Serial.printf("AP IDR: ok=%d ack=%u (%s) idr=0x%08lX\n", ap_ok ? 1 : 0, (unsigned)ack, swd_min::ack_to_str(ack),
                (unsigned long)ap_idr);
  return ap_ok;
}

static bool cmd_toggle_verbose() {
  const bool enabled = !swd_min::verbose_enabled();
  swd_min::set_verbose(enabled);
  Serial.printf("SWD verbose: %s\n", enabled ? "ON" : "OFF");
  return true;
}

static bool cmd_dp_abort_write_test() {
  // The bench failure shows ACK=7 (invalid) for the first DP write (ABORT clear).
  // This test runs the exact same DP write twice:
  //   1) while NRST is still asserted low (as left by reset_and_switch_to_swd)
  //   2) after releasing NRST high
  // so you can compare scope waveforms and see if NRST state is the deciding factor.
  const uint32_t abort_clear = (1u << 4) | (1u << 3) | (1u << 2) | (1u << 1); // 0x1E

  Serial.println("DP ABORT write test (no reset)...");
  Serial.println("Phase 1: DP WRITE ABORT=0x0000001E");
  {
    uint8_t ack = 0;
    const bool ok = swd_min::dp_write_reg(swd_min::DP_ADDR_ABORT, abort_clear, &ack);
    Serial.printf("ABORT write: ok=%d ack=%u (%s)\n", ok ? 1 : 0, (unsigned)ack, swd_min::ack_to_str(ack));
  }

  Serial.println("Phase 2: release NRST HIGH, delay 5ms, then DP WRITE ABORT=0x0000001E");
  swd_min::set_nrst(false);
  delay(5);
  {
    uint8_t ack = 0;
    const bool ok = swd_min::dp_write_reg(swd_min::DP_ADDR_ABORT, abort_clear, &ack);
    Serial.printf("ABORT write (NRST HIGH): ok=%d ack=%u (%s)\n", ok ? 1 : 0, (unsigned)ack, swd_min::ack_to_str(ack));
  }

  return true;
}

static bool cmd_ap_csw_write_readback_test() {
  // Goal: a *single* DP write immediately after attach:
  // DP CTRL/STAT (addr 0x04) = 0x50000000
  // This matches the ADIv5 power-up request pattern used by our bring-up code.
  static constexpr uint32_t CTRLSTAT_PWRUP_REQ = 0x50000000u; // (1<<30)|(1<<28)

  // Assumes SWD already attached via 'i' or the boot-time auto attempt.
  // (Bench observation: a prior IDCODE read makes the following DP write ACK reliably.)
  Serial.println("DP CTRL/STAT single-write test (no reset, no IDCODE read)...");

  uint8_t ack = 0;
  Serial.printf("Writing DP CTRL/STAT (DP 0x%02X) = 0x%08lX...\n", (unsigned)swd_min::DP_ADDR_CTRLSTAT,
                (unsigned long)CTRLSTAT_PWRUP_REQ);
  const bool ok = swd_min::dp_write_reg(swd_min::DP_ADDR_CTRLSTAT, CTRLSTAT_PWRUP_REQ, &ack);
  Serial.printf("DP WRITE CTRL/STAT: ok=%d ack=%u (%s)\n", ok ? 1 : 0, (unsigned)ack, swd_min::ack_to_str(ack));
  return ok;
}

static bool cmd_all() {
  if (!cmd_connect()) return false;
  if (!stm32g0_prog::flash_mass_erase()) return false;
  if (!cmd_write()) return false;
  return cmd_verify();
}

void setup() {
  Serial.begin(115200);
  while (!Serial) {
    delay(10);
  }

  Serial.println("\nESP32-S3 STM32G0 Programmer");
  Serial.println("Wiring: GPIO35=SWCLK GPIO36=SWDIO GPIO37=NRST");
  if (ensure_fs_mounted()) {
    firmware_fs::print_status();

    if (!serial_log::begin(SPIFFS)) {
      Serial.printf("Serial log init FAIL (%s)\n", serial_log::log_path());
    }
    if (serial_log::has_serial_next()) {
      Serial.printf("Next serial (loaded): %lu\n", (unsigned long)serial_log::serial_next());
    } else {
      Serial.println("Next serial (loaded): NOT SET (use WiFi UI to set it)");
    }

    String fw_path;
    if (firmware_fs::find_single_firmware_bin(fw_path)) {
      program_state::set_firmware_filename(fw_path);
      File f = SPIFFS.open(fw_path.c_str(), "r");
      if (f) {
        Serial.printf("Selected firmware size: %lu bytes\n", (unsigned long)f.size());
        f.close();
      }
    }
  }

  swd_min::begin(PINS);

  pinMode(k_prod_button_pin, INPUT_PULLUP);

  // Start WiFi AP + web UI on the other core.
  wifi_web_ui::start_task();

